

const DATA = [
{
h: "Часть 1", 
t: `Раньше люди не умели извлекать квадратный корень из отрицательных чисел,
но когда им пришлось решать кубические уравнения, это понадобилось.
Корнем из отрицательного числа не может быть никакое обычное, т.е. вещественное, число,
вот здесь и были открыты (или изобретены) комплексные числа.
Комплексное число z состоит из пары вещественных чисел, a и b.
z = a + bi
Число a составляет вещественную часть z, 
число b - его мнимую часть и это обозначается буквой i 
(от слова imagination), например, z = 2 + 3i.

Если вещественные числа изображают точками на прямой,
то комплексные числа изображают точками на плоскости.
Еще добавляют линию от точки до начала координат, получается вектор.
`,
a:["", "z = 2 + 3i", "", ""]
},
{
h: "Часть 2", 
t: `
Если b = 0, то z делается обычным вещественным числом.
Если a = 0, то z делается мнимым числом.
Букву i следует рассматривать как мнимое число, квадрат которого равен -1.

Иногда можно услышать, что i - это квадратнй корень из -1, но это неверно,
т.к. тогда получается, что i = √(i * i) = √(-i * -i) = -i, что возможно, только если i = 0.
У числа -1 два квадратных корня, и число i только один из них, второй корень -i.`,
a:["", "x = 2", "y = 2i", "z = 2 + 3i"]
},
{
h: "Часть 3", 
t: `Если вещественные числа изображают точками на прямой,
то комплексные числа изображают точками на плоскости.
Еще добавляют линию от точки до начала координат, получается вектор.`,
a:["", "", "", ""]
}
];


