

const DATA = [
{
h: "Мнимые числа", 
t: `Раньше люди не умели извлекать квадратный корень из 
отрицательных чисел, им это даже в голову не приходило.
Но когда им пришлось решать кубические уравнения, это 
понадобилось.
Корнем из отрицательного числа не может быть число 
положитеьное, но и отрицательное - тоже не может. 
Т.е. никакое вещественное число не является квадратным 
корнем из отрицательного числа.
Вот здесь и были открыты невещественные числа, которые 
получили название мнимых. 
Чтобы отличать их от обычных чисел, в конце к ним 
приписывают латинскую букву i, от слова imagination.
Именно среди мнимых чисел находятся квадратные корни из 
отрицательных вещественных чисел, например √-4 = 2i,
потому что по их определению i^2 = -1.
Как и вещественные, мнимые числа изображают точками на 
числовой оси, только располагают эту ось перпендикулярно 
оси вещественных чисел.  
`,
a:["", "x = -4", "y = x^0.5", ""]
},
{
h: "Комплексные числа", 
t: `
Комплексное число z = a + bi состоит из вещественной и
мнимой части, например, z = 2 + 3i.
Именно комплексные числа оказались инструментом
описания физических и других аспектов нашей реальности.
Например, основная теорема алгебры гласит, что любое 
уравнение n-ой степени имеет ровно n комплексных корней.
Тут надо сказать, что и вещественное, и мнимое число - 
частный случай числа комплексного.Если b = 0, то z 
делается вещественным числом. Если a = 0, то z 
делается мнимым числом.
Если вещественные числа изображают точками на прямой,
то комплексные числа изображают точками на плоскости.
Чтоб сделать точку заметнее, добавляют линию - 
получается вектор.
`,
a:["", "x = 2", "y = 2i", "z = 2 + 3i"]
},
{
h: "Сложение", 
t: `Комплексные числа не были бы числами, если бы с ними
нельзя было выполнять арифметические действия.
Сложение выполняется по правилу параллелограмма, т.е.
отдельно складываются вещественные части, отдельно 
мнимые, и из них образуется новое комплексное число.
a = 2 + i; b = -0.5 + 2i; c = a + b;
`,
a:["", "a = 2 + i", "b = -0.5 + 2i", "c = a + b"]
},
{
   h: "Умножение", 
   t: `Комплексные числа умножаются как многочлены
   (1.7 + 0.5i) * (-0.5 + 2i) = 0.5 + 2.7i
   Заметим, что треугольник, образованный числами 1 и a
   и треугольник, образованный числами b и c подобны 
   друг другу. 
   Вопрос: какие еще два подобных треугольника можно
   увидеть на диаграмме?
   `,
   a:["", "a = 1.7 + 0.5i", "b = -0.5 + 2i", "c = a + b"]
},
{
   h: "Тригонометрическая форма", 
   t: `
   
   `,
   a:["", "", "", ""]
},

{
   h: "Показательная форма", 
   t: `
   
   `,
   a:["", "", "", ""]
},



];


